app/Http/Controllers/DashboardController.php

    public function index()
    {
        $ad = Ad::inRandomOrder()->first();
        if($ad) $ad->image_url = $ad->getSidebarAttribute();


        $posts = Post::where('is_featured', true)->where('is_published', true)->take(4)->get();
---
select * from "posts" where "is_featured" = 1 and "is_published" = 1